let userInput = prompt("Введіть вік:");
let year = parseInt(userInput);

if (!isNaN(year) && year > 0 && Number.isInteger(year)) {

    let s = "";
    let x2 = year % 100;
    if (x2 >= 10 && x2 <= 19) {
        s = " років";
    } else {
        let x1 = year % 10;
        if (x1 == 1) {
            s = " рік";
        } else if (x1 == 2 || x1 == 3 || x1 == 4) {
            s = " роки";
        } else {
            s = " років";
        }
    }

    console.log(year + s);

} else {
    console.log("Це не є додатнє ціле число або введене значення не є числом.");
}



/*
0 - років
1 - рік
2 - роки
3 - роки
4 - роки
5 - років
6 - років
7 - років
8 - років
9 - років
10-19 - років
20 - років
21 - рік
22 - роки
23 - роки
24 - роки
25 - років
26 - років
27 - років
28 - років
29 - років
(останні дві цифри)***10-19 - років
(остання одна цифра)***1 - рік, 2/3/4 - роки, 0/5/6/7/8/9 - років
*/