/*Вам необхідно намалювати в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого символу): 
на першому рядку - одна зірочка, на другій дві, і так далі. Рішення оформіть у вигляді функції, куди передаються два параметри: 
висота трикутника та символ, яким його потрібно "малювати".

drawTriangle(5, *);

*
**
***
****
*****

Домашню роботу необхідно зробити двома способами
В задачі не потрібно використовувати prompt або щось інше повязане з UI
Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки*/

 drawTriangle(5, "0");
 drawTriangle(10, "0");
 drawTriangle(15, "0");
 
function drawTriangle(height, form){
    for(let i = 1; i <= height; i++){
        let s = "";
        for(let j = 1; j <= i; j++){
            s = s + form;
        }
        console.log(s);
    }
}    
